read_verilog Conductual.v
hierarchy -check -top Conductual
proc;
opt;
fsm;
opt;
memory;
opt;
techmap;
opt;
write_verilog rtlil.v
dfflibmap -liberty cmos_cells.lib;
abc -liberty cmos_cells.lib;
clean
write_verilog sintetizado.v
